app/controllers/articles_controller.rb

  def update
    #Store the query in an instance variable.
    @article = Article.find(params[:id])
    #Update the values passed from the form
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-07-20 13:07:26.917847"], ["id", 1]]